БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыВремениГрафика/ВидыВремениГрафика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыВремениГрафика</name>
  <predefined>
    <items>
      <name>РабочееВремя</name>
      <description>Рабочее время</description>
    </items>
  </predefined>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремяТабеля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Catalogs/ВидыВремениГрафика/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УО = Список.УсловноеОформление.Элементы;
	Выб = Справочники.ВидыВремениГрафика.Выбрать();
	Пока Выб.Следующий() Цикл
		Если Выб.Ссылка <> Справочники.ВидыВремениГрафика.РабочееВремя Тогда
			
			Цвет = Выб.Цвет.Получить();
			Если Цвет <> Новый Цвет(0,0,0) Тогда
				ЭлементУО = УО.Добавить();
				ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона",Цвет);
				
				// Условие форматирования
				ЭлементУсловия  = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементУсловия.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
				ЭлементУсловия.ВидСравнения	  = ВидСравненияКомпоновкиДанных.Равно;
				ЭлементУсловия.ПравоеЗначение = Выб.Ссылка;
				
				// Оформляемое поле
				ОформлПоле = ЭлементУО.Поля.Элементы.Добавить();
				ОформлПоле.Поле = Новый ПолеКомпоновкиДанных("Код");
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
